linux/emacs/org-slides/slides.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Slides with Org-Mode and JavaScript</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2008-09-06 15:58:41 CEST"/>
<meta name="author" content="Sebastian Rose"/>
<link rel="stylesheet"                type="text/css" href="slides.css" />
</head><body>
<h1 id="title">Slides with Org-Mode and JavaScript</h1>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Welcome to Org-mode and Slides</a></li>
<li><a href="#sec-2">Overview</a></li>
<li><a href="#sec-3">Create the Org-mode file</a></li>
<li><a href="#sec-4">Export the Org-mode file to XHTML</a></li>
<li><a href="#sec-5">Create a stylesheet for slides</a>
<ul>
<li><a href="#sec-5.1">CSS - body</a></li>
<li><a href="#sec-5.2">CSS - headlines</a></li>
<li><a href="#sec-5.3">CSS - org-info-js</a></li>
</ul>
</li>
<li><a href="#sec-6">TODOS</a></li>
<li><a href="#sec-7"></a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Welcome to Org-mode and Slides</h2>
<div id="text-1">


<ul>
<li>
Navigate back and and forth on doubleclick and click.
</li>
<li>
Use all the navigation and text facilities of org-info.js in your
presentations.
</li>
<li>
Remove warnings on click.
</li>
<li>
No warnings when navigating with the mouse.
</li>
<li>
Simple lists are shown item by item automatically.
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Overview</h2>
<div id="text-2">


<ul>
<li>
Create the Org-mode file
</li>
<li>
Export the Org-mode file to XHTML
</li>
<li>
Create a stylesheet for slides
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Create the Org-mode file</h2>
<div id="text-3">


<p>
<b>Structure for slides</b>
</p>
<p>
<pre class="example">
 * Overview

   + Create the Org-mode file

 * Overview

   + Create the Org-mode file
   + Export the Org-mode file to XHTML
</pre>
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Export the Org-mode file to XHTML</h2>
<div id="text-4">


<p>
<code>view:slide</code>
</p>
<p>
<pre class="example">
#+INFOJS_OPT: toc:nil ltoc:nil view:slide mouse:underline


* COMMENT html style specifications
# Local Variables:
# org-export-html-style: "&lt;link rel=\"stylesheet\" \
#                type=\"text/css\" href=\"slides.css\" /&gt;"
# End:
</pre>
</p>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Create a stylesheet for slides</h2>
<div id="text-5">


<ul>
<li>
Stylesheets for slides are different.
</li>
<li>
The body uses the whole width.
</li>
<li>
Use the same style for all headlines.
</li>
<li>
The postamble will be hidden automatically.
</li>
<li>
Position org-info.js's window.
</li>
</ul>



</div>

<div id="outline-container-5.1" class="outline-3">
<h3 id="sec-5.1">CSS - body</h3>
<div id="text-5.1">


<p>
Choose a big font!
</p>
<p>
<pre class="example">
body
{
  width:100%;
  padding:0px 0px 0px 0px;
  margin:0px 0px 0px 0px;
  background-image:url(img/bg.gif);
  background-attachment:fixed;
  background-repeat:repeat-x;
  /* ... etc. */
}
</pre>
</p>
</div>

</div>

<div id="outline-container-5.2" class="outline-3">
<h3 id="sec-5.2">CSS - headlines</h3>
<div id="text-5.2">


<p>
Set all headlines to the same size:
</p>
<p>
<pre class="example">
h1,h2,h3,h4,h5,h6
{
  font-size: 18pt;
  font-weight:bold;
  color:#104d8c;
  /* ... etc. */
}
</pre>
</p>
</div>

</div>

<div id="outline-container-5.3" class="outline-3">
<h3 id="sec-5.3">CSS - org-info-js</h3>
<div id="text-5.3">


<p>
Position the org-info.js window.
</p>
<p>
<pre class="example">
#org-info-js-window
{
  position:absolute;
  top:140px;
  left:20%;
}
</pre>
</p>

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">TODOS</h2>
<div id="text-6">


<ul>
<li id="sec-6.1"><span class="todo">TODO</span> More features.<br/>
</li>
<li id="sec-6.2"><span class="todo">TODO</span> Load stylsheets dynamically.<br/>
</li>
<li id="sec-6.3"><span class="todo">TODO</span> Drop lot's of mails with bugs and wishes.<br/>

<p>

<hr/>
</p>
</li>
<li id="sec-6.4"><span class="todo">TODO</span> Have Fun with Org-mode and all the tools around.<br/>

</li>
</ul>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="done">DONE</span></h2>
<div id="text-7">


<p>
That's all folks.
</p>

</div>
</div>
<div id="postamble"><p class="author"> Author: Sebastian Rose
<a href="mailto:sebastian_rose@gmx.de">&lt;sebastian_rose@gmx.de&gt;</a>
</p>
<p class="date"> Date: 2008-09-06 15:58:41 CEST</p>
<p>HTML generated by org-mode 6.06b in emacs 23</p>
</div></body>
</html>
